'''

Напишите программу «Зооферма», в которой будет создано несколько объектов класса Critter, а манипулиро­
вать ими всеми можно будет с помощью списка. Теперь пользователь должен заботиться не об одной зверюш­
ке, а обо всех обитателях зоофермы. Выбирая пункт в меню, пользователь выбирает действие, которое хотел
бы выполнить со всеми зверюшками: покормить их, поиграть с ними или узнать об их самочувствии. Чтобы
программа была интереснее, при создании каждой зверюшки следует назначать ей случайно выбранные
уровни голода и уныния.

'''
